SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p_trng.h
/* Bit fields for TRNG FIFODEPTH */
#define _TRNG_FIFODEPTH_RESETVALUE             0x00000040UL                         /**< Default value for TRNG_FIFODEPTH */
#define _TRNG_FIFODEPTH_MASK                   0xFFFFFFFFUL                         /**< Mask for TRNG_FIFODEPTH */
#define _TRNG_FIFODEPTH_VALUE_SHIFT            0                                    /**< Shift value for TRNG_VALUE */
#define _TRNG_FIFODEPTH_VALUE_MASK             0xFFFFFFFFUL                         /**< Bit mask for TRNG_VALUE */
#define _TRNG_FIFODEPTH_VALUE_DEFAULT          0x00000040UL                         /**< Mode DEFAULT for TRNG_FIFODEPTH */
#define TRNG_FIFODEPTH_VALUE_DEFAULT           (_TRNG_FIFODEPTH_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_FIFODEPTH */

/* Bit fields for TRNG KEY0 */
#define _TRNG_KEY0_RESETVALUE                  0x00000000UL                    /**< Default value for TRNG_KEY0 */
#define _TRNG_KEY0_MASK                        0xFFFFFFFFUL                    /**< Mask for TRNG_KEY0 */
#define _TRNG_KEY0_VALUE_SHIFT                 0                               /**< Shift value for TRNG_VALUE */
#define _TRNG_KEY0_VALUE_MASK                  0xFFFFFFFFUL                    /**< Bit mask for TRNG_VALUE */
#define _TRNG_KEY0_VALUE_DEFAULT               0x00000000UL                    /**< Mode DEFAULT for TRNG_KEY0 */
#define TRNG_KEY0_VALUE_DEFAULT                (_TRNG_KEY0_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_KEY0 */

/* Bit fields for TRNG KEY1 */
#define _TRNG_KEY1_RESETVALUE                  0x00000000UL                    /**< Default value for TRNG_KEY1 */
#define _TRNG_KEY1_MASK                        0xFFFFFFFFUL                    /**< Mask for TRNG_KEY1 */
#define _TRNG_KEY1_VALUE_SHIFT                 0                               /**< Shift value for TRNG_VALUE */
#define _TRNG_KEY1_VALUE_MASK                  0xFFFFFFFFUL                    /**< Bit mask for TRNG_VALUE */
#define _TRNG_KEY1_VALUE_DEFAULT               0x00000000UL                    /**< Mode DEFAULT for TRNG_KEY1 */
#define TRNG_KEY1_VALUE_DEFAULT                (_TRNG_KEY1_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_KEY1 */

/* Bit fields for TRNG KEY2 */
#define _TRNG_KEY2_RESETVALUE                  0x00000000UL                    /**< Default value for TRNG_KEY2 */
#define _TRNG_KEY2_MASK                        0xFFFFFFFFUL                    /**< Mask for TRNG_KEY2 */
#define _TRNG_KEY2_VALUE_SHIFT                 0                               /**< Shift value for TRNG_VALUE */
#define _TRNG_KEY2_VALUE_MASK                  0xFFFFFFFFUL                    /**< Bit mask for TRNG_VALUE */
#define _TRNG_KEY2_VALUE_DEFAULT               0x00000000UL                    /**< Mode DEFAULT for TRNG_KEY2 */
#define TRNG_KEY2_VALUE_DEFAULT                (_TRNG_KEY2_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_KEY2 */

/* Bit fields for TRNG KEY3 */
#define _TRNG_KEY3_RESETVALUE                  0x00000000UL                    /**< Default value for TRNG_KEY3 */
#define _TRNG_KEY3_MASK                        0xFFFFFFFFUL                    /**< Mask for TRNG_KEY3 */
#define _TRNG_KEY3_VALUE_SHIFT                 0                               /**< Shift value for TRNG_VALUE */
#define _TRNG_KEY3_VALUE_MASK                  0xFFFFFFFFUL                    /**< Bit mask for TRNG_VALUE */
#define _TRNG_KEY3_VALUE_DEFAULT               0x00000000UL                    /**< Mode DEFAULT for TRNG_KEY3 */
#define TRNG_KEY3_VALUE_DEFAULT                (_TRNG_KEY3_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_KEY3 */

/* Bit fields for TRNG TESTDATA */
#define _TRNG_TESTDATA_RESETVALUE              0x00000000UL                        /**< Default value for TRNG_TESTDATA */
#define _TRNG_TESTDATA_MASK                    0xFFFFFFFFUL                        /**< Mask for TRNG_TESTDATA */
#define _TRNG_TESTDATA_VALUE_SHIFT             0                                   /**< Shift value for TRNG_VALUE */
#define _TRNG_TESTDATA_VALUE_MASK              0xFFFFFFFFUL                        /**< Bit mask for TRNG_VALUE */
#define _TRNG_TESTDATA_VALUE_DEFAULT           0x00000000UL                        /**< Mode DEFAULT for TRNG_TESTDATA */
#define TRNG_TESTDATA_VALUE_DEFAULT            (_TRNG_TESTDATA_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_TESTDATA */

/* Bit fields for TRNG REPTHRES */
#define _TRNG_REPTHRES_RESETVALUE              0x0000003DUL                        /**< Default value for TRNG_REPTHRES */
#define _TRNG_REPTHRES_MASK                    0xFFFFFFFFUL                        /**< Mask for TRNG_REPTHRES */
#define _TRNG_REPTHRES_VALUE_SHIFT             0                                   /**< Shift value for TRNG_VALUE */
#define _TRNG_REPTHRES_VALUE_MASK              0xFFFFFFFFUL                        /**< Bit mask for TRNG_VALUE */
#define _TRNG_REPTHRES_VALUE_DEFAULT           0x0000003DUL                        /**< Mode DEFAULT for TRNG_REPTHRES */
#define TRNG_REPTHRES_VALUE_DEFAULT            (_TRNG_REPTHRES_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_REPTHRES */

/* Bit fields for TRNG PROP1THRES */
#define _TRNG_PROP1THRES_RESETVALUE            0x00000033UL                          /**< Default value for TRNG_PROP1THRES */
#define _TRNG_PROP1THRES_MASK                  0xFFFFFFFFUL                          /**< Mask for TRNG_PROP1THRES */
#define _TRNG_PROP1THRES_VALUE_SHIFT           0                                     /**< Shift value for TRNG_VALUE */
#define _TRNG_PROP1THRES_VALUE_MASK            0xFFFFFFFFUL                          /**< Bit mask for TRNG_VALUE */
#define _TRNG_PROP1THRES_VALUE_DEFAULT         0x00000033UL                          /**< Mode DEFAULT for TRNG_PROP1THRES */
#define TRNG_PROP1THRES_VALUE_DEFAULT          (_TRNG_PROP1THRES_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_PROP1THRES */

/* Bit fields for TRNG PROP2THRES */
#define _TRNG_PROP2THRES_RESETVALUE            0x000008C0UL                          /**< Default value for TRNG_PROP2THRES */
#define _TRNG_PROP2THRES_MASK                  0xFFFFFFFFUL                          /**< Mask for TRNG_PROP2THRES */
#define _TRNG_PROP2THRES_VALUE_SHIFT           0                                     /**< Shift value for TRNG_VALUE */
#define _TRNG_PROP2THRES_VALUE_MASK            0xFFFFFFFFUL                          /**< Bit mask for TRNG_VALUE */
#define _TRNG_PROP2THRES_VALUE_DEFAULT         0x000008C0UL                          /**< Mode DEFAULT for TRNG_PROP2THRES */
#define TRNG_PROP2THRES_VALUE_DEFAULT          (_TRNG_PROP2THRES_VALUE_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_PROP2THRES */

/* Bit fields for TRNG STATUS */
#define _TRNG_STATUS_RESETVALUE                0x00000000UL                             /**< Default value for TRNG_STATUS */
#define _TRNG_STATUS_MASK                      0x000007F1UL                             /**< Mask for TRNG_STATUS */
#define TRNG_STATUS_TESTDATABUSY               (0x1UL << 0)                             /**< High when data written to TestData register is being processed */
#define _TRNG_STATUS_TESTDATABUSY_SHIFT        0                                        /**< Shift value for TRNG_TESTDATABUSY */
#define _TRNG_STATUS_TESTDATABUSY_MASK         0x1UL                                    /**< Bit mask for TRNG_TESTDATABUSY */
#define _TRNG_STATUS_TESTDATABUSY_DEFAULT      0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_TESTDATABUSY_DEFAULT       (_TRNG_STATUS_TESTDATABUSY_DEFAULT << 0) /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_REPFAIL                    (0x1UL << 4)                             /**< Repetition Count Test interrupt status */
#define _TRNG_STATUS_REPFAIL_SHIFT             4                                        /**< Shift value for TRNG_REPFAIL */
#define _TRNG_STATUS_REPFAIL_MASK              0x10UL                                   /**< Bit mask for TRNG_REPFAIL */
#define _TRNG_STATUS_REPFAIL_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_REPFAIL_DEFAULT            (_TRNG_STATUS_REPFAIL_DEFAULT << 4)      /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PROP1FAIL                  (0x1UL << 5)                             /**< Adaptive Proportion Test (64-sample window) interrupt status */
#define _TRNG_STATUS_PROP1FAIL_SHIFT           5                                        /**< Shift value for TRNG_PROP1FAIL */
#define _TRNG_STATUS_PROP1FAIL_MASK            0x20UL                                   /**< Bit mask for TRNG_PROP1FAIL */
#define _TRNG_STATUS_PROP1FAIL_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PROP1FAIL_DEFAULT          (_TRNG_STATUS_PROP1FAIL_DEFAULT << 5)    /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PROP2FAIL                  (0x1UL << 6)                             /**< Adaptive Proportion Test (4096-sample window) interrupt status */
#define _TRNG_STATUS_PROP2FAIL_SHIFT           6                                        /**< Shift value for TRNG_PROP2FAIL */
#define _TRNG_STATUS_PROP2FAIL_MASK            0x40UL                                   /**< Bit mask for TRNG_PROP2FAIL */
#define _TRNG_STATUS_PROP2FAIL_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PROP2FAIL_DEFAULT          (_TRNG_STATUS_PROP2FAIL_DEFAULT << 6)    /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_FULLINT                    (0x1UL << 7)                             /**< FIFO full interrupt status */
#define _TRNG_STATUS_FULLINT_SHIFT             7                                        /**< Shift value for TRNG_FULLINT */
#define _TRNG_STATUS_FULLINT_MASK              0x80UL                                   /**< Bit mask for TRNG_FULLINT */
#define _TRNG_STATUS_FULLINT_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_FULLINT_DEFAULT            (_TRNG_STATUS_FULLINT_DEFAULT << 7)      /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PREINT                     (0x1UL << 8)                             /**< Preliminary noise alarm status */
#define _TRNG_STATUS_PREINT_SHIFT              8                                        /**< Shift value for TRNG_PREINT */
#define _TRNG_STATUS_PREINT_MASK               0x100UL                                  /**< Bit mask for TRNG_PREINT */
#define _TRNG_STATUS_PREINT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_PREINT_DEFAULT             (_TRNG_STATUS_PREINT_DEFAULT << 8)       /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_ALMINT                     (0x1UL << 9)                             /**< Noise alarm status */
#define _TRNG_STATUS_ALMINT_SHIFT              9                                        /**< Shift value for TRNG_ALMINT */
#define _TRNG_STATUS_ALMINT_MASK               0x200UL                                  /**< Bit mask for TRNG_ALMINT */
#define _TRNG_STATUS_ALMINT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_ALMINT_DEFAULT             (_TRNG_STATUS_ALMINT_DEFAULT << 9)       /**< Shifted mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_STARTUPPASS                (0x1UL << 10)                            /**< Start-up test pass status */
#define _TRNG_STATUS_STARTUPPASS_SHIFT         10                                       /**< Shift value for TRNG_STARTUPPASS */
#define _TRNG_STATUS_STARTUPPASS_MASK          0x400UL                                  /**< Bit mask for TRNG_STARTUPPASS */
#define _TRNG_STATUS_STARTUPPASS_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for TRNG_STATUS */
#define TRNG_STATUS_STARTUPPASS_DEFAULT        (_TRNG_STATUS_STARTUPPASS_DEFAULT << 10) /**< Shifted mode DEFAULT for TRNG_STATUS */

